jnk0le/simple-crt/stm32_vectors.c
/*****************************************************************************
 * STM32 mass vector table definitions                                       *
 * Author : jnk0le@hotmail.com                                               *
 *          https://github.com/jnk0le                                        *
 * License: CC0                                                              *
 *****************************************************************************/

	__attribute__((weak)) void Default_Handler(void); // [-Wmissing-prototypes]
	__attribute__((weak)) void Default_Handler(void)
	{
	#ifdef DEBUG
		while(1) asm volatile("bkpt #0");
	#else
		while(1);
	#endif
	}

	void __attribute__ ((weak, alias("Default_Handler"))) NMI_Handler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HardFault_Handler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SVC_Handler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PendSV_Handler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SysTick_Handler(void);

#if defined(__ARM_ARCH_7M__)||defined(__ARM_ARCH_7EM__)
	void __attribute__ ((weak, alias("Default_Handler"))) MemManage_Handler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BusFault_Handler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UsageFault_Handler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DebugMon_Handler(void);
#endif

#if defined(STM32F030)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);

#elif defined(STM32F030xC)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_6_IRQHandler(void);

#elif defined(STM32F031)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);

#elif defined(STM32F042)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_VDDIO2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_CRS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TSC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CEC_CAN_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_IRQHandler(void);

#elif defined(STM32F051)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TSC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_COMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CEC_IRQHandler(void);

#elif defined (STM32F070x6)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_IRQHandler(void);

#elif defined (STM32F070xB)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_IRQHandler(void);

