jnk0le/simple-crt/stm32_vectors.c
#elif defined (STM32F072)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_VDDIO2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_CRS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TSC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_COMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CEC_CAN_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_IRQHandler(void);

#elif defined (STM32F091)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_VDDIO2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_CRS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TSC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_COMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_UP_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_8_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CEC_CAN_IRQHandler(void);

#elif defined(STM32F10X_LD)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TAMPER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_HP_CAN1_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_LP_CAN1_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_SCE_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI9_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_UP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI15_10_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTCAlarm_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBWakeUp_IRQHandler(void);

