jnk0le/simple-crt/stm32_vectors.c
#elif defined(STM32F10X_CL)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TAMPER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_SCE_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI9_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_UP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI15_10_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTCAlarm_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ETH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ETH_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_SCE_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_IRQHandler(void);

#elif defined(STM32F30X)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TAMPER_STAMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_TS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC1_2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_HP_CAN1_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_LP_CAN1_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_SCE_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI9_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_UP_TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_TRG_COM_TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI15_10_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_Alarm_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBWakeUp_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_BRK_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_UP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) COMP1_3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) COMP4_6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) COMP7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C3_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C3_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_HP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USB_LP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBWakeUp_RMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM20_BRK_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM20_UP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM20_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM20_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FPU_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI4_IRQHandler(void);

#elif defined(STM32F405xx)||defined(STM32F407xx)||defined(STM32F415xx)||defined(STM32F417xx)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TAMP_STAMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_SCE_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI9_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_TIM9_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_UP_TIM10_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_TRG_COM_TIM11_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI15_10_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_Alarm_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_BRK_TIM12_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_UP_TIM13_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_TRG_COM_TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SDIO_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ETH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ETH_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN2_SCE_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C3_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C3_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_EP1_OUT_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_EP1_IN_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DCMI_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CRYP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HASH_RNG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FPU_IRQHandler(void);

