jnk0le/simple-crt/stm32_vectors.c
#elif defined(GD32F450)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDGT_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TAMPER_STAMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCU_CTC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN0_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN0_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN0_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN0_EWMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI5_9_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER0_BRK_TIMER8_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER0_UP_TIMER9_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER0_TRG_CMT_TIMER10_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER0_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C0_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C0_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI10_15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_Alarm_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBFS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER7_BRK_TIMER11_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER7_UP_TIMER12_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER7_TRG_CMT_TIMER13_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER7_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA0_Channel7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SDIO_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER5_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIMER6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ENET_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ENET_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_TX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_RX1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CAN1_EWMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBFS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Channel7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBHS_EP1_Out_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBHS_EP1_In_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBHS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USBHS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DCI_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TRNG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FPU_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TLI_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TLI_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) IPA_IRQHandler(void);

