jnk0le/simple-crt/stm32_vectors.c
#elif defined(STM32H743xx)
	void __attribute__ ((weak, alias("Default_Handler"))) WWDG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) PVD_AVD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TAMP_STAMP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FLASH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RCC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FDCAN1_IT0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FDCAN2_IT0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FDCAN1_IT1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FDCAN2_IT1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI9_5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_BRK_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_UP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_TRG_COM_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM1_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C1_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C2_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) EXTI15_10_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RTC_Alarm_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_BRK_TIM12_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_UP_TIM13_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_TRG_COM_TIM14_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM8_CC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA1_Stream7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SDMMC1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM6_DAC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ETH_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ETH_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FDCAN_CAL_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2_Stream7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) USART6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C3_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C3_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_EP1_OUT_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_EP1_IN_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_HS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DCMI_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) RNG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) FPU_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) UART8_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPI6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SAI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LTDC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LTDC_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMA2D_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SAI2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) QUADSPI_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LPTIM1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CEC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C4_EV_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) I2C4_ER_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SPDIF_RX_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_EP1_OUT_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_EP1_IN_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) OTG_FS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMAMUX1_OVR_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HRTIM1_Master_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HRTIM1_TIMA_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HRTIM1_TIMB_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HRTIM1_TIMC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HRTIM1_TIMD_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HRTIM1_TIME_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HRTIM1_FLT_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DFSDM1_FLT0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DFSDM1_FLT1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DFSDM1_FLT2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DFSDM1_FLT3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SAI3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SWPMI1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM15_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM16_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) TIM17_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) MDIOS_WKUP_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) MDIOS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) JPEG_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) MDMA_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SDMMC2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) HSEM1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ADC3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) DMAMUX2_OVR_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel0_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel6_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) BDMA_Channel7_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) COMP1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LPTIM2_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LPTIM3_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LPTIM4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LPTIM5_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) LPUART1_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) CRS_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) ECC_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) SAI4_IRQHandler(void);
	void __attribute__ ((weak, alias("Default_Handler"))) WAKEUP_PIN_IRQHandler(void);

#else
	#error "unsupported or unknown MCU"
#endif

