jnk0le/simple-crt/stm32_vectors.c
#elif defined(GD32F450)
	WWDGT_IRQHandler,
	LVD_IRQHandler,
	TAMPER_STAMP_IRQHandler,
	RTC_WKUP_IRQHandler,
	FMC_IRQHandler,
	RCU_CTC_IRQHandler,
	EXTI0_IRQHandler,
	EXTI1_IRQHandler,
	EXTI2_IRQHandler,
	EXTI3_IRQHandler,
	EXTI4_IRQHandler,
	DMA0_Channel0_IRQHandler,
	DMA0_Channel1_IRQHandler,
	DMA0_Channel2_IRQHandler,
	DMA0_Channel3_IRQHandler,
	DMA0_Channel4_IRQHandler,
	DMA0_Channel5_IRQHandler,
	DMA0_Channel6_IRQHandler,
	ADC_IRQHandler,
	CAN0_TX_IRQHandler,
	CAN0_RX0_IRQHandler,
	CAN0_RX1_IRQHandler,
	CAN0_EWMC_IRQHandler,
	EXTI5_9_IRQHandler,
	TIMER0_BRK_TIMER8_IRQHandler,
	TIMER0_UP_TIMER9_IRQHandler,
	TIMER0_TRG_CMT_TIMER10_IRQHandler,
	TIMER0_CC_IRQHandler,
	TIMER1_IRQHandler,
	TIMER2_IRQHandler,
	TIMER3_IRQHandler,
	I2C0_EV_IRQHandler,
	I2C0_ER_IRQHandler,
	I2C1_EV_IRQHandler,
	I2C1_ER_IRQHandler,
	SPI0_IRQHandler,
	SPI1_IRQHandler,
	USART0_IRQHandler,
	USART1_IRQHandler,
	USART2_IRQHandler,
	EXTI10_15_IRQHandler,
	RTC_Alarm_IRQHandler,
	USBFS_WKUP_IRQHandler,
	TIMER7_BRK_TIMER11_IRQHandler,
	TIMER7_UP_TIMER12_IRQHandler,
	TIMER7_TRG_CMT_TIMER13_IRQHandler,
	TIMER7_CC_IRQHandler,
	DMA0_Channel7_IRQHandler,
	EXMC_IRQHandler,
	SDIO_IRQHandler,
	TIMER4_IRQHandler,
	SPI2_IRQHandler,
	UART3_IRQHandler,
	UART4_IRQHandler,
	TIMER5_DAC_IRQHandler,
	TIMER6_IRQHandler,
	DMA1_Channel0_IRQHandler,
	DMA1_Channel1_IRQHandler,
	DMA1_Channel2_IRQHandler,
	DMA1_Channel3_IRQHandler,
	DMA1_Channel4_IRQHandler,
	ENET_IRQHandler,
	ENET_WKUP_IRQHandler,
	CAN1_TX_IRQHandler,
	CAN1_RX0_IRQHandler,
	CAN1_RX1_IRQHandler,
	CAN1_EWMC_IRQHandler,
	USBFS_IRQHandler,
	DMA1_Channel5_IRQHandler,
	DMA1_Channel6_IRQHandler,
	DMA1_Channel7_IRQHandler,
	USART5_IRQHandler,
	I2C2_EV_IRQHandler,
	I2C2_ER_IRQHandler,
	USBHS_EP1_Out_IRQHandler,
	USBHS_EP1_In_IRQHandler,
	USBHS_WKUP_IRQHandler,
	USBHS_IRQHandler,
	DCI_IRQHandler,
	0,
	TRNG_IRQHandler,
	FPU_IRQHandler,
	UART6_IRQHandler,
	UART7_IRQHandler,
	SPI3_IRQHandler,
	SPI4_IRQHandler,
	SPI5_IRQHandler,
	0,
	TLI_IRQHandler,
	TLI_ER_IRQHandler,
	IPA_IRQHandler,

#elif defined(STM32H743xx)
	WWDG_IRQHandler,
	PVD_AVD_IRQHandler,
	TAMP_STAMP_IRQHandler,
	RTC_WKUP_IRQHandler,
	FLASH_IRQHandler,
	RCC_IRQHandler,
	EXTI0_IRQHandler,
	EXTI1_IRQHandler,
	EXTI2_IRQHandler,
	EXTI3_IRQHandler,
	EXTI4_IRQHandler,
	DMA1_Stream0_IRQHandler,
	DMA1_Stream1_IRQHandler,
	DMA1_Stream2_IRQHandler,
	DMA1_Stream3_IRQHandler,
	DMA1_Stream4_IRQHandler,
	DMA1_Stream5_IRQHandler,
	DMA1_Stream6_IRQHandler,
	ADC_IRQHandler,
	FDCAN1_IT0_IRQHandler,
	FDCAN2_IT0_IRQHandler,
	FDCAN1_IT1_IRQHandler,
	FDCAN2_IT1_IRQHandler,
	EXTI9_5_IRQHandler,
	TIM1_BRK_IRQHandler,
	TIM1_UP_IRQHandler,
	TIM1_TRG_COM_IRQHandler,
	TIM1_CC_IRQHandler,
	TIM2_IRQHandler,
	TIM3_IRQHandler,
	TIM4_IRQHandler,
	I2C1_EV_IRQHandler,
	I2C1_ER_IRQHandler,
	I2C2_EV_IRQHandler,
	I2C2_ER_IRQHandler,
	SPI1_IRQHandler,
	SPI2_IRQHandler,
	USART1_IRQHandler,
	USART2_IRQHandler,
	USART3_IRQHandler,
	EXTI15_10_IRQHandler,
	RTC_Alarm_IRQHandler,
	0,
	TIM8_BRK_TIM12_IRQHandler,
	TIM8_UP_TIM13_IRQHandler,
	TIM8_TRG_COM_TIM14_IRQHandler,
	TIM8_CC_IRQHandler,
	DMA1_Stream7_IRQHandler,
	FMC_IRQHandler,
	SDMMC1_IRQHandler,
	TIM5_IRQHandler,
	SPI3_IRQHandler,
	UART4_IRQHandler,
	UART5_IRQHandler,
	TIM6_DAC_IRQHandler,
	TIM7_IRQHandler,
	DMA2_Stream0_IRQHandler,
	DMA2_Stream1_IRQHandler,
	DMA2_Stream2_IRQHandler,
	DMA2_Stream3_IRQHandler,
	DMA2_Stream4_IRQHandler,
	ETH_IRQHandler,
	ETH_WKUP_IRQHandler,
	FDCAN_CAL_IRQHandler,
	0,
	0,
	0,
	0,
	DMA2_Stream5_IRQHandler,
	DMA2_Stream6_IRQHandler,
	DMA2_Stream7_IRQHandler,
	USART6_IRQHandler,
	I2C3_EV_IRQHandler,
	I2C3_ER_IRQHandler,
	OTG_HS_EP1_OUT_IRQHandler,
	OTG_HS_EP1_IN_IRQHandler,
	OTG_HS_WKUP_IRQHandler,
	OTG_HS_IRQHandler,
	DCMI_IRQHandler,
	0,
	RNG_IRQHandler,
	FPU_IRQHandler,
	UART7_IRQHandler,
	UART8_IRQHandler,
	SPI4_IRQHandler,
	SPI5_IRQHandler,
	SPI6_IRQHandler,
	SAI1_IRQHandler,
	LTDC_IRQHandler,
	LTDC_ER_IRQHandler,
	DMA2D_IRQHandler,
	SAI2_IRQHandler,
	QUADSPI_IRQHandler,
	LPTIM1_IRQHandler,
	CEC_IRQHandler,
	I2C4_EV_IRQHandler,
	I2C4_ER_IRQHandler,
	SPDIF_RX_IRQHandler,
	OTG_FS_EP1_OUT_IRQHandler,
	OTG_FS_EP1_IN_IRQHandler,
	OTG_FS_WKUP_IRQHandler,
	OTG_FS_IRQHandler,
	DMAMUX1_OVR_IRQHandler,
	HRTIM1_Master_IRQHandler,
	HRTIM1_TIMA_IRQHandler,
	HRTIM1_TIMB_IRQHandler,
	HRTIM1_TIMC_IRQHandler,
	HRTIM1_TIMD_IRQHandler,
	HRTIM1_TIME_IRQHandler,
	HRTIM1_FLT_IRQHandler,
	DFSDM1_FLT0_IRQHandler,
	DFSDM1_FLT1_IRQHandler,
	DFSDM1_FLT2_IRQHandler,
	DFSDM1_FLT3_IRQHandler,
	SAI3_IRQHandler,
	SWPMI1_IRQHandler,
	TIM15_IRQHandler,
	TIM16_IRQHandler,
	TIM17_IRQHandler,
	MDIOS_WKUP_IRQHandler,
	MDIOS_IRQHandler,
	JPEG_IRQHandler,
	MDMA_IRQHandler,
	0,
	SDMMC2_IRQHandler,
	HSEM1_IRQHandler,
	0,
	ADC3_IRQHandler,
	DMAMUX2_OVR_IRQHandler,
	BDMA_Channel0_IRQHandler,
	BDMA_Channel1_IRQHandler,
	BDMA_Channel2_IRQHandler,
	BDMA_Channel3_IRQHandler,
	BDMA_Channel4_IRQHandler,
	BDMA_Channel5_IRQHandler,
	BDMA_Channel6_IRQHandler,
	BDMA_Channel7_IRQHandler,
	COMP1_IRQHandler,
	LPTIM2_IRQHandler,
	LPTIM3_IRQHandler,
	LPTIM4_IRQHandler,
	LPTIM5_IRQHandler,
	LPUART1_IRQHandler,
	0,
	CRS_IRQHandler,
	ECC_IRQHandler,
	SAI4_IRQHandler,
	0,
	0,
	WAKEUP_PIN_IRQHandler
#else
	#error "unsupported or unknown MCU"
#endif
};
